Revit 2026 API

# AnalysisDisplayStyleMarkerType Enumeration

---

Marker types for Markers and Text settings of analysis display style.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AnalysisDisplayStyleMarkerType
```
```vb
Public Enumeration AnalysisDisplayStyleMarkerType
```
```cpp
public enum class AnalysisDisplayStyleMarkerType
```
```fsharp
type AnalysisDisplayStyleMarkerType
```

| Member name | Value | Description |
| --- | --- | --- |
| Circle | 0 |  |
| Square | 1 |  |
| Triangle | 2 |  |

#### Reference

Autodesk.Revit.DB.Analysis Namespace